app/controllers/license_data_controller.rb

  def create
    byebug
    # Process image_data using OCR (Tesseract)
    text_data = process_image_data(params[:image_data])

    # For simplicity, assume extracted data is hardcoded
    extracted_data = {
      name: text_data['name'],
      address: text_data['address'],
      issuance_date: text_data['issuance_date'],
      expiration_date: text_data['expiration_date'],
      license_number: text_data['license_number']
    }

    # Save extracted data to the database
    @license_data = LicenseDatum.new(extracted_data)

    if @license_data.save
---
INSERT INTO "license_data" ("name", "address", "issuance_date", "expiration_date", "created_at", "updated_at", "license_number") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"